tutorials/cfdemSolverIBPICI/SC/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType none;

couplingInterval 100;

depth 0;

voidFractionModel IB;

locateModel engineIB;

meshMotionModel noMeshMotion;

dataExchangeModel twoWayMPI;//twoWayFiles;

IOModel off;//basicIO;

probeModel off;

averagingModel dilute;

clockModel off;

smoothingModel off;

checkPeriodicCells true;

forceModels
(
    ReactionIB    //ShirgaonkarIB
    ArchimedesIB
);

momCoupleModels
(
);

//turbulenceModelType RASProperties;//LESProperties; //OFversion24x
turbulenceModelType turbulenceProperties; //OFversion30x

//===========================================================================//
// sub-model properties

ShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
}
ReactionIBProps
{
    velFieldName "U";
    pressureFieldName "p";
    interForceFieldName "Fs";
    densityFieldName "rho";
}

ArchimedesIBProps
{
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
}

twoWayFilesProps
{
    maxNumberOfParticles 10000;
    DEMts 0.00003;
}

twoWayMPIProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsPerParticle 50000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

bigParticleProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}
centreProps
{
    alphaMin 0.30;
}

dividedProps
{
    alphaMin 0.05;
    scaleUpVol 1.2;
}

engineIBProps
{
    treeSearch false;
    zSplit 50;
    xySplit 100;
    coef 2;
}

wall_blockPeriodicityCheck
{
//Enforce reading of the blocking for periodic checks; true means blocking the check.
    x true;
    y false;
    z false;
}

// ************************************************************************* //
