tutorials/cfdemSolverIBPICI/SC/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet      
    {
        type            fixedValue;
        value           uniform (2e-4 0 0);
        //value           uniform (0 0 0);
    }
/*
    wall      
    {
        type            zeroGradient;

    }
*/
    outlet      
    {
        type            zeroGradient;
    }

    /*frontAndBack    
    {
        type            empty;
    }*/
    wall1
	{
	type cyclic;
	}
    wall2
	{
	type cyclic;
	}
    wall3
	{
	type cyclic;
	}
    wall4
	{
	type cyclic;
	}

}

// ************************************************************************* //
