tutorials/cfdemSolverIBPICI/SC/CFD/0/phiIB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiIB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet      
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 0; 
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
        //type            zeroGradient;
    }

/*
    wall      
    {
        type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
*/
    wall1
	{
	type cyclic;
	}
    wall2
	{
	type cyclic;
	}
    wall3
	{
	type cyclic;
	}
    wall4
	{
	type cyclic;
	}

}

// ************************************************************************* //
