tutorials/cfdemSolverIBPICI/SC/CFD/0/voidfraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      voidfraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
/*
    wall      
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
*/  
    wall1
	{
	type cyclic;
	}
    wall2
	{
	type cyclic;
	}
    wall3
	{
	type cyclic;
	}
    wall4
	{
	type cyclic;
	}

}

// ************************************************************************* //
